src/gSOAPGEN/20170313/rdlite.SetMeta.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="urn:rdLite">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:SetMeta>
   <stationId>0</stationId>
   <id>0</id>
   <index>0</index>
   <name></name>
   <dataLen>0</dataLen>
   <isValue>false</isValue>
   <isAlarm>false</isAlarm>
  </ns2:SetMeta>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
