src/gSOAPGEN/20170313/rdlite.SetStation.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="urn:rdLite">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:SetStation>
   <id>0</id>
   <name></name>
   <isScada>false</isScada>
   <recvHost></recvHost>
   <recvPort>0</recvPort>
   <syncHost></syncHost>
   <syncPort>0</syncPort>
  </ns2:SetStation>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
