src/gSOAPGEN/20170313/rdlite.Query.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="urn:rdLite">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:Query>
   <stationId>0</stationId>
   <tagId>
    <item>0</item>
    <item>0</item>
   </tagId>
   <valueType>0</valueType>
   <beginTime>0</beginTime>
   <endTime>0</endTime>
   <count>0</count>
  </ns2:Query>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
